html/Misc/website_refactor_ad_infinitum/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Website-Refactor( Website-Refactor( &#x2026;))</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta http-equiv="X-UA-Compatible" content="ie=edge">
<title>Blah</title>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.1.2/css/all.min.css" integrity="sha512-1sCRPdkRXhBV2PBLUdRb4tMg1w2YPf37qatUFeS7zlBy7jJI8Lf4VHwWfZZfpXtYSLy85pkm9GaYVYMfw5BC1A==" crossorigin="anonymous" referrerpolicy="no-referrer">
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css">
</head>
<body>
<div id="preamble" class="status">
<header> <a href="http://localhost:8080/">Main</a> :: <a href="http://localhost:8080/Misc/">Misc</a> ::</header></header>
</div>
<div id="content" class="content">
<h1 class="title">Website-Refactor( Website-Refactor( &#x2026;))</h1>
<p>
I wonder how much time I will waste cumulatively remaking my website.
I've decided to start formally marking down my thoughts when I change it to double down on the wasting time.
</p>

<p>
I've established <a href="../personal_websites_are_dumb/">personal websites are dumb</a>, but here I am again; another year, another website refactor.
</p>

<p>
My enthusiasm for emacs led me to look into Emacs Lisp which caused a <a href="../../../Articles/Programming/a-lispy-interlude/">deep dive into the very interesting world of lisp</a>
</p>

<p>
Python was previously used to glue all the exported html together and I've decided to switch to Common Lisp
(There <i>might</i> be some good reasons for this:
more expressive, ANSI standard, lindy, etc. but really I was just curious / wanted to challenge myself to learn something new. I also
really came around to the Lambda Calculus style/ s-expressions. Surely not worth the time investment, but what is?)
</p>

<p>
The more anachronistic and inscrutable the better I guess.
It is nice to be able to permanently live in emacs.
And yet, and yet&#x2026;:
</p>

<blockquote>
<p>
There are two ways to write error-free programs; only the third one works.
</p>
<ul class="org-ul">
<li>Alan Perlis</li>
</ul>
</blockquote>
</div>
<div id="postamble" class="status">
<footer><p>©Ian Stranathan <script>document.write(new Date().getFullYear())</script></p></footer>
</div>
</body>
</html>